<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class CalculatorController extends BaseController
{
    // *******************************************
    // コンストラクタ
    // *******************************************
    public function __construct()
    {
        parent::__construct();
    }
    
    
    // *******************************************
    // 計算開始確認画面
    // *******************************************
    public function getReady()
    {
        dd('計算開始確認画面');
    
    }
    
    // *******************************************
    // 計算結果確認画面
    // *******************************************
    public function getResultConfirm()
    {
        dd('計算結果確認画面');
    
    }
    
    // *******************************************
    // 計算結果登録処理
    // *******************************************
    public function postComplete()
    {
        dd('計算結果登録処理');
    
    }
    
    // *******************************************
    // 計算結果完了画面
    // *******************************************
    public function getComplete()
    {
        dd('計算結果完了画面');
    
    }
    
    // *******************************************
    // 計算結果履歴一覧画面
    // *******************************************
    public function getList()
    {
        dd('計算結果履歴一覧画面');
    
    }
    
    // *******************************************
    // 計算結果詳細画面
    // *******************************************
    public function getDetail($calculation_id)
    {
        dd('計算結果詳細画面');
    
    }
}
