<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class RebarController extends BaseController
{
    // *******************************************
    // コンストラクタ
    // *******************************************
    public function __construct()
    {
        parent::__construct();
    }

    // *******************************************
    // 鉄筋情報一覧画面
    // *******************************************
    public function getList()
    {
        dd('鉄筋情報一覧画面');
    }
    
    // *******************************************
    // 鉄筋情報入力方法・工場選択画面
    // *******************************************
    public function getSelect()
    {
        dd('鉄筋情報入力方法・工場選択画面');
    }
    
    // *******************************************
    // 鉄筋情報手入力画面
    // *******************************************
    public function getRegister($diameter)
    {
        dd('鉄筋情報手入力画面');
    }
    
    // *******************************************
    // 鉄筋情報手入力確認画面
    // *******************************************
    public function getConfirm($diameter)
    {
        dd('鉄筋情報手入力確認画面');
    }
    
    // *******************************************
    // 鉄筋情報手入力編集画面
    // *******************************************
    public function getEdit($calculation_id, $diameter)
    {
        dd('鉄筋情報手入力編集画面');
    }
    
    // *******************************************
    // 鉄筋情報CSVアップロード画面
    // *******************************************
    public function getCsvRegister()
    {
        dd('鉄筋情報CSVアップロード画面');
    }

    // *******************************************
    // 鉄筋情報CSV読み込みアップロード画面
    // Requestはバリデーションにより適宜最適なものを使用してください
    // *******************************************
    public function postCsvUpload(Request $request)
    {
        dd('鉄筋情報CSV読み込みアップロード画面');
    }

    // *******************************************
    // 鉄筋情報CSVアップロード確認画面
    // *******************************************
    public function getCsvConfirm()
    {
        dd('鉄筋情報CSVアップロード確認画面');
    }

    // *******************************************
    // 鉄筋情報登録・編集完了処理 
    // Requestはバリデーションにより適宜最適なものを使用してください
    // *******************************************
    public function postComplete(Request $request)
    {
        dd('鉄筋情報登録・編集完了処理');
    }
    
    // *******************************************
    // 鉄筋情報登録・編集完了画面
    // *******************************************
    public function getComplete()
    {
        dd('鉄筋情報登録・編集完了画面');
    }
    
    // *******************************************
    // 鉄筋情報詳細画面
    // *******************************************
    public function getDetail($calculation_id)
    {
        dd('鉄筋情報詳細画面');
    }
}
